package tasks.test_2022_2;

// Что это
/*
Академия Яндекса
Летняя школа 2022 года
Направление - Бэкенд-разработка - Java

Тестовое задание для поступления в школу
В каждой папке описание задания (tz.txt),
решения, комментарии
 */

// Примечания
/*
Решения в этом пакете не являются идеальными,
это один из вариантов решения.
Вы можете их улучшить.

Задания летней и осенней школы 2022 года
очень похожи по смыслу

В задании тесты внесены в классы
(потому что решения скармливались одним файлом боту),
в своих решениях вы можете тесты вынести отдельно

 */